{
  "common": {
    "navigation": {
      "about": "소개",
      "projects": "프로젝트",
      "contact": "연락처"
    }
  },
  "main": {
    "title": "이유림",
    "description": "Frontend Developer"
  },
  "about": {
    "title": "안녕하세요! 저는 JavaScript, TypeScript, React, Next.js를 다루는 4년차 프론트엔드 개발자 이유림입니다. ",
    "description": "기술과 사람 모두에 열정을 가지고, 사용자 경험과 팀의 성과를 높이는 개발자가 되기위해 노력하고 있어요. 다양한 기술과 도메인을 빠르게 익히며 더 나은 문제 해결 방식을 고민합니다. 함께 성장하고 소통하는 팀워크를 소중히 여깁니다! 🍀"
  },
  "skills": {
    "title": "기술스택",
    "frontend": "Frontend",
    "backend": "Backend",
    "etc": "DevOps"
  },
  "contents": {
    "technology": "사용기술",
    "info": "자세히 보기"
  },
  "projects": {
    "healthcare": {
      "title": "한국 스마트헬스케어협회 CRO 어드민",
      "subtitle": "의료진들의 메타버스 교육 플랫폼을 위한 어드민 웹",
      "description": "VR 기기를 활용해 의료진이 메타버스 환경에서 교육받을 수 있는 플랫폼의 어드민 페이지 개발에 프론트엔드 역할로 참여했습니다. 접속 추이, 개인 진도율, 수강생의 강의 평가 및 수업별 선호도 통계를 확인할 수 있는 대시보드를 구현했습니다. 주요 통계를 차트로 시각화하고, 필터 기능을 통해 데이터를 다양한 조건으로 분석할 수 있도록 개발했습니다. 특히, Recharts 라이브러리를 활용해 데이터 시각화를 커스터마이징하여 직관적이고 유려한 UI를 제공했습니다. 배포 후 사용자 피드백을 반영해 기능을 추가 및 개선하며 프로젝트를 지속적으로 발전시켰습니다."
    },
    "education": {
      "title": "스마트 헬스케어 교육 홈페이지",
      "subtitle": "의료진을 위한 메타버스 교육을 생성하고 관리 페이지",
      "description": "VR 메타버스 교육을 생성하고 관리할 수 있는 교육 관리 플랫폼을 개발했습니다. 메인 인트로 페이지, 강의 생성, 수강 인원 추가, 강의 자료 업로드 및 관리, 강의 정보 조회 등 주요 기능을 구현했습니다. 특히, 코드 스플리팅과 React Suspense 기능 및 스켈레톤 화면을 도입해 강의 자료 업로드 시 발생하는 딜레이와 화면 불안정을 효과적으로 개선하여 사용자 경험을 향상시켰습니다. 배포 이후 클라이언트로부터 긍정적인 피드백을 받을 수 있었습니다"
    },
    "kongju": {
      "title": "공주대학교 예술대학 메타버스 교육 홈페이지",
      "subtitle": "대학교 원격 웹메타버스 강의 및 수업관리 서비스",
      "description": "공주대학교 예술대학 학생들을 위한 원격 웹 메타버스 강의 및 수업 관리 홈페이지를 개발했습니다. 로그인, 채팅, 수업 내 미니게임, 강의 자료 조회 및 관리 등 주요 기능을 구현했습니다. 특히, 실시간 채팅과 참여형 미니게임을 위해 리얼타임 서버 통신을 연결하고 적용했습니다. 채팅 화면의 불필요한 렌더링과 깜빡임을 방지하기 위해 React.memo와 React.useCallback을 활용해 최적화를 진행했습니다. 또한, 사다리 게임에서 랜덤 인원 배정과 실시간 결과 확인 기능을 구현하기 위해 백엔드 개발자와 긴밀히 협업하며 매끄럽게 동작하도록 개발했습니다. 프로젝트 전반에 걸쳐 안정성과 사용자 경험을 개선하는 데 주력했습니다."
    },
    "itall": {
      "title": "잇올 스파르타 어드민",
      "subtitle": "전국 100여개 관리형 독서실 학생관리를 위한 어드민 웹",
      "description": "관리형 독서실을 위한 어드민 페이지 개발에 팀원들과 함께 참여했습니다. 안내 및 CS 기능, 학생 알림 기능 등 주요 기능을 구현하는 데 기여했으며, 앱 사용자가 보낸 SOS 알림이 웹에서 실시간으로 전달되도록 소켓 연결을 통해 알람 시스템을 개발했습니다. 이미지 리스트 로딩 최적화 작업에 참여해 성능을 개선했으며, 팀원들과 함께 모노레포 구조와 아토믹 디자인 패턴을 도입해 코드의 재사용성과 유지보수성을 높였습니다. 협업을 통해 직관적이고 효율적인 어드민 페이지를 완성하는 데 기여했습니다."
    }
  }
}